{"pageProps":{"post":{"slug":"from-forest-trails-to-glaciers-our-most-unforgettable-week-in-norway","title":"From Forest Trails to Glaciers: Our Most Unforgettable Week in Norway","date":"August 6, 2025","tags":["scandinavia","itinerary","travel"],"coverImage":"/images/norway2025/1.jpg","content":"\nYou know that smart idea you have when you’re already tired? That’s how this trip started.\n\nWe had just finished moving apartments — in the middle of summer, sweating like we were in a gym we didn’t sign up for. Our backs ached, our muscles felt like jelly, and the idea of packing again for a vacation sounded like punishment.\n\nBut then… the little voice in my head went, “You know what you need? A road trip.”\n\nAnd not just any road trip — a 7-day drive through central and western Norway. Because obviously, the cure for exhaustion is… more exhaustion.\n\n## The Drone Plan\n\nTo spice things up, we bought a drone. Not the toy kind — the one that makes you feel like a movie director.\n\nOf course, in Europe, you can’t just fly a drone wherever you want unless you like paying fines the size of a small car. So the week before the trip, I was cramming drone pilot courses like a college student before finals.\n\nBy the time we left, I had my EU license, the drone was charged, and I was ready to terrorize seagulls across Norway.\n\n## Setting the Route\n\nWe had 7 days. 2 would disappear in just getting from Sweden to Norway and back. That left 5 days to:\n\n- Drive scenic roads\n- See waterfalls, fjords, and glaciers\n- Take more drone shots than a human should\n\nOne driver, one rest day in the middle, and one big rule: the trip’s mission was to touch a glacier.\n\nTrollstigen — the legendary mountain road — had just opened for the season, so it became our farthest point before turning back. But the real prize was Bøyabreen Glacier in Fjærland.\n\nThe route looked like this:\nOslo → Trollstigen → Geiranger → Bøyabreen Glacier, Fjærland → Flåm → Oslo\n\n## Packing Like a Doomsday Prepper\n\nNorway is beautiful, but if you shop there too much, your wallet starts crying. So we packed like we were going on an Arctic survival mission:\n\n- Portable stove & gas cans\n- Canned food, protein bars, fruit, nuts\n- Coffee & tea (because you don’t mess with caffeine supply)\n\nThe plan was simple — cook in scenic spots, avoid overpriced restaurants, and stay away from big cities as much as possible.\n\n## Day 1 – Sweden → Oslo\n\nThe morning of 19th July was golden and warm, with that gentle breeze that makes you think the world’s in a good mood. We left at 9 a.m., windows down, music up, and the back of the car rattling with camping gear.\n\nAbout two hours in, we pulled over at a rest stop — one of those quiet roadside spots where the only sound is the wind in the trees and the occasional truck rumbling past. We unpacked the stove, chopped up some vegetables, and fried them in the open air. The smell of sizzling onions mixed with pine trees and hot asphalt — oddly comforting.\n\nWhile lunch was cooking, I unpacked the drone. The first flight was shaky, my fingers a little clumsy, but within minutes I was zipping it over the tree line, watching the tiny live feed of endless forest.\n\nBy late afternoon, Oslo’s skyline appeared. My wife’s friend met us at the door with that big smile only old friends give you. Inside, the smell of Bangladeshi spices hit me first — warm, homey, like a hug for your stomach. We ate until we couldn’t move.\n\n## Day 2 – Oslo → Lesjaskogsvatnet Camping\n\nWe rolled out of Oslo around 10 a.m., our trusty volvo v60 humming along narrow roads lined with red-painted houses..\n\nFirst stop was Ringebu Stave Church. The wooden walls were the color of dark honey, weathered by centuries of wind and snow. Inside, the air smelled of dry wood and history. You could almost hear the shuffle of boots from hundreds of years ago.\n\nNext was Myfallet Waterfall. The road there narrowed into something that looked like a driveway, ending in a barrier. We hiked through a forest so green it looked fake, the air heavy with the smell of wet leaves. The waterfall roared in the distance before we even saw it.\n\nWe couldn’t resist — we waded into the river. The water was cool and sharp, the kind that makes you gasp at first but then feels perfect on a warm summer day.\n\nBy then, we were too tired for our third planned stop. We headed straight to Lesjaskogsvatnet Camping, a lake so still it reflected the mountains like a mirror. The only sound was the soft slap of water against the shore. That evening, we flew the drone as the sky turned orange, the lake glowing like molten gold.\n\n<!--gallery-->\n![Ringebu Stave Church](/images/norway2025/DJI_0019.jpeg)\n![Myfallet](/images/norway2025/DJI_0029.jpeg)\n![Mya River](/images/norway2025/myfallet.jpeg)\n![Lesjaskogsvatnet Lake](/images/norway2025/DJI_0030.jpeg)\n<!--gallery-->\n\n## Day 3 – Trollstigen & Geiranger\n\nWe started early.\n\nTrollstigen is not just a road — it’s a dare. Eleven hairpin bends, a 10% incline, and cliffs so steep you wonder if the guardrails are just decorative. Waterfalls burst out of the rock on both sides.\n\nFrom the top, Trollstigen looked unreal — a silver ribbon curling down the mountainside in eleven tight bends. We sent the drone gliding over the valley, capturing the tiny cars far below, the waterfalls crashing down beside them, and the still blue lake above, quietly feeding all that power.\n\nBy midday, we reached Geiranger. The fjord was glassy blue, framed by cliffs and waterfalls with names like “Seven Sisters” and “The Bridal Veil.” Unfortunately, it was also packed with tourists — cruise ships, buses, and people everywhere. The smell of sunscreen and fried food floated in the warm air. We didn’t linger.\n\nWe ended the day at Djupvatnet Lake, high in the mountains. The air was thin and cool, the water so clear it was like looking into another world. The drone footage here is a Chef’s kiss.\n\n<!--gallery-->\n![Trollstigen road](/images/norway2025/trolls_1.jpeg)\n![Trollstigen](/images/norway2025/trolls_2.jpeg)\n![Geirangerfjord](/images/norway2025/gei_01.jpeg)\n![Seven Sisters Waterfall](/images/norway2025/gei_02.jpeg)\n![Geirangerfjord](/images/norway2025/gei_03.jpeg)\n<!--gallery-->\n\n## Day 4 – Sunnfjord: The Lake, The Fish, The Waterfall\n\nThis was supposed to be a lazy day. Just 122 km.\n\nWe reached our cottage by early afternoon — and our jaws dropped. On two sides: mountains. On another: a crystal-clear lake, greenish-blue, so calm it felt wrong to disturb it, and in front of us: a roaring waterfall straight from the glacier.\n\nWe dumped our bags and ran straight into the lake water. It was cold enough to make my chest tighten — but then came the tickling. Fish, tiny and curious, nibbling at our toes. Nature’s spa treatment.\n\nLater, we took the canoe out. Every stroke of the paddle sent ripples across the mirrored surface, mountains and sky bending and breaking in the water. Flying the drone from the canoe was a whole new level of tricky — first, I had to train my wife to steer us smoothly with the paddle. Only then could I focus on getting the shots, balancing the controls while the boat kept moving under me.\n\nThat night, we sat on the balcony with mugs of hot tea, watching the glacier glow under the fading light.\n\n<!--gallery-->\n![Sunnfjord](/images/norway2025/s1.jpeg)\n![Sunnfjord](/images/norway2025/s2.jpeg)\n![Sunnfjord](/images/norway2025/s3.jpeg)\n<!--gallery-->\n\n## Day 5 – Mission: Touch the Glacier\n\nFrom the viewpoint, Bøyabreen Glacier looked close — like you could stroll over in 15 minutes. Lies.\n\nWe decided to hike to it. The path was barely a path — mud, dense forest, then swamps so cold they made our bones ache. Our feet went numb, came back to life, then went numb again. At one point, we had to climb over a fallen tree, water sloshing inside our shoes.\n\nFinally, the forest opened up into a rocky slope. Above us, the glacier loomed — blue and white, massive and alive, groaning softly as it shifted. Below, we could see chunks of ice breaking off in the glacier calving, crashing into the cold water. Waterfalls poured down the cliffs nearby, their spray mixing with a gentle rain that cooled our faces. There was no one else around — just us, the wind, the falling ice, and the steady drip of melting glacier water.\n\nWe touched it. Hard, smooth, older than anything I’d ever touched before. My wife stacked some rocks into a little tower — our mark that we’d made it.\n\n<!--gallery-->\n![Bøyabreen Glacier](/images/norway2025/g1.jpeg)\n![Bøyabreen Glacier Viewpoint](/images/norway2025/g2.jpeg)\n![Bøyabreen Glacier Viewpoint](/images/norway2025/g3.jpeg)\n![Mammoths!](/images/norway2025/g4.jpg)\n<!--gallery-->\n\n## Day 6 – Fjærland → Flåm\n\nFlåm was quieter than Geiranger, with the fjord stretching out like a silver ribbon. We drove up to Stegastein viewpoint — a platform hanging over the valley. The air was sharp and cool, the kind that wakes you up from the inside out.\n\nWe flew the drone here until the wind picked up, and even the drone seemed to say, “Nope.”\n\n<!--gallery-->\n![Flåm](/images/norway2025/f1.jpeg)\n![Aurlandsfjord](/images/norway2025/f2.jpeg)\n![Stegastein](/images/norway2025/f3.jpeg)\n<!--gallery-->\n\n## Day 7 – Flåm → Oslo → Sweden\n\nWe stopped in Oslo again to see friends. Their living room smelled of fresh coffee and warm food. We stayed too long, laughed too much, and ate until I thought I’d need a nap before driving.\n\nWe left at 4 p.m., the road fading from mountains to the flat Swedish countryside. Pulled into home at 1 a.m., car dusty, drone batteries dead, and memory cards full.\n\nhttps://www.youtube.com/watch?v=ODvbeGMV8Bk\n\nNorway isn’t just scenery — it’s a mood, a smell, a shock of cold water on your skin, a silence so deep you hear your own heartbeat. It’s the taste of coffee at a roadside stop with mountains in every direction. And for me, it’s the feeling of ice under my hand in the middle of summer."}},"__N_SSG":true}