{"pageProps":{"post":{"slug":"the-little-mermaid-of-copenhagen-tiny-statue-with-huge-story","title":"The Little Mermaid of Copenhagen: A Tiny Statue With a Huge Story","date":"2025-10-04","tags":["denmark","scandinavia"],"coverImage":"/images/little_mermaid/1.webp","author":"","content":"\nAfter visiting **Lund** and **Malmö** in southern Sweden, we wanted to explore a bigger and busier city. So we decided to go to **Copenhagen**, the capital of **Denmark**.\n\n### Crossing the Øresund Bridge\n\nOne fine morning, we took the **Øresund train** from Malmö to Copenhagen. The train crosses the famous [**Øresund Bridge**](https://visitskane.com/classic-attractions/oresund-bridge), a long bridge that connects **Sweden** and **Denmark**. It’s amazing to travel from one country to another in just about 40 minutes!\n\n### First Stop: The Little Mermaid\n\nOur first plan was to meet **The Little Mermaid**, the most famous statue in Copenhagen. We got off the train at **Østerport Station**, and from there it was only about 15 minutes’ walk.\n\nThe statue is near [**Kastellet Fortress**](https://www.kastellet.com/en/to-do/museum/), a beautiful old fort surrounded by water and walking paths. We walked through the quiet park, and finally — there she was!\n\nIt was a cloudy October day, typical weather for Scandinavia. The sky was grey, and the sea was calm. The Little Mermaid looked a bit sad — maybe because of the gloomy weather — and it showed in all our photos too!\n\n### Who is The Little Mermaid?\n\nThe Little Mermaid is a **bronze sculpture** made by [**Edvard Eriksen**](https://en.wikipedia.org/wiki/Edvard_Eriksen) in **1913**. She is based on the famous fairy tale by Danish writer [**Hans Christian Andersen**](https://www.britannica.com/biography/Hans-Christian-Andersen-Danish-author).\n\nThe story is about a young mermaid who falls in love with a prince. She dreams of becoming human and gives up her voice to live on land. It’s a story of love, hope, and sadness — and that’s why the statue also looks thoughtful and lonely.\n\n<!--gallery-->\n![](/images/little_mermaid/2.webp)\n![](/images/little_mermaid/3.webp)\n![](/images/little_mermaid/4.webp)\n![](/images/little_mermaid/5.webp)\n![](/images/little_mermaid/6.webp)\n<!--gallery-->\n\n### Behind the scene\n\nHere’s a lovely part of the story:\nA Danish brewer named [**Carl Jacobsen**](https://www.carlsberggroup.com/175-years/a-history-of-brewing/carl-jacobsen/), who also founded the [**Carlsberg**](https://www.carlsberggroup.com/) beer company, went to see a **ballet performance** of *The Little Mermaid* at the [**Royal Danish Theatre**](https://kglteater.dk/en).\n\nHe loved the story so much that he asked the sculptor **Edvard Eriksen** to make a statue of the mermaid. The dancer who played the mermaid in the ballet inspired him, but she didn’t want to model for the sculpture — so Eriksen’s **wife, [Eline Eriksen](https://dbpedia.org/page/Eline_Eriksen)**, posed instead!\n\nSo, the Little Mermaid you see today is partly inspired by art, love, and family — a true Danish creation.\n\n### A Tough Life\n\nEven though she looks peaceful, the Little Mermaid has had a difficult life. Over the years, some people have damaged her many times.\n\n* In **1964**, someone cut off her head!\n* In **1984**, her arm was removed — but returned a few days later.\n* In **1998**, her head was stolen again but later found and replaced.\n* In **2003**, she was pushed into the water!\n\nSometimes she is also painted or dressed up during protests. Still, she always comes back — strong and smiling again.\n\n### Symbol of Copenhagen\n\nThe Little Mermaid is more than just a statue. She is a **symbol of Copenhagen** — just like the **Eiffel Tower** is for Paris or the **Statue of Liberty** is for New York.\n\nShe reminds visitors of Denmark’s love for art, stories, and the sea. Even though she is small, she has a big place in the hearts of people all around the world.\n\n**Travel Tip:**\nThe best time to visit The Little Mermaid is early in the morning or late in the evening — when there are fewer tourists. Bring a jacket (it’s windy near the water!) and take a quiet moment to enjoy the view of the harbour.\n\n### What’s Next?\n\nAfter spending some quiet time with the Little Mermaid, we started walking again — this time towards Amalienborg Palace, the royal home of the Danish Queen. The beautiful palace square and the changing of the guards were waiting for us!\n\n👉 Read the next part of our “Trip in Denmark” series: A Royal Morning at Amalienborg Palace.\n"}},"__N_SSG":true}