{"pageProps":{"tag":"mythology","posts":[{"slug":"scandinavian-trolls-from-myth-to-modern-magic","title":"Scandinavian Trolls: From Myth to Modern Magic","date":"2023-05-15","tags":["culture","scandinavia","mythology","travel"],"coverImage":"/images/trolls.jpg","content":"\nTrolls are everywhere in Norway, from miniatures and sculptures in shops to street names and countless place names. Recently I have had a road trip on different parts of Norway and I got curious about these intriguing creatures. I delved into the world of trolls.\n\nTrolls are a fundamental part of Norwegian culture, deeply embedded in art, literature, and media. These mythical beings are often depicted in traditional Norwegian fairy tales and folklore, where they range from menacing antagonists to simple, nature-bound creatures.\n\nIn Norwegian lore, trolls are depicted as real beings living in mountains, forests, or caves. They are often large, connected to nature, and antagonistic towards humans and gods alike. Remarkably, trolls were even mentioned in Norwegian Christian laws, which forbade people from eating with them or waking them up at night.\n\n<!--gallery-->\n![William](/images/trolls_1.JPG)\n![Poppy](/images/trolls_2.JPG)\n![Bert](/images/trolls_3.JPG)\n![Branch](/images/trolls_4.JPG)\n![Poppy](/images/trolls_5.JPG)\n<!--gallery-->\n\nIn literature and folklore, trolls are usually portrayed as ugly, aggressive creatures with a love for mischief and trickery. They symbolize chaos and disruption and are often associated with the wild, untamed aspects of nature. These stories also spread to Sweden, Denmark, Finland, and Iceland, making trolls a common figure in Scandinavian folklore.\n\nInterestingly, the word ‘troll’ likely originated from the Norwegian words for witches and witchcraft, “trollfolk” and “trolldom,” respectively. This etymology hints at the deep-rooted mysticism and fear surrounding these creatures.\n\nBut trolls aren’t just confined to old tales. They have found a place in modern culture as well. From the charmingly mischievous troll dolls popularized in the 1960s to the trolls in the “Frozen” movies, these mythical beings continue to capture our imagination. There’s even a genre of Scandinavian horror films that bring trolls to life in contemporary settings, blending ancient myths with modern-day storytelling.\n\nSo, the next time you encounter a troll statue in Norway or hear a story about these enigmatic creatures, remember that you’re tapping into a rich tapestry of folklore that has been woven over centuries. Whether seen as fearsome giants or mischievous tricksters, trolls remain an enduring and fascinating part of Norwegian culture.\n\nIn case want to dive more into trolls here are some movies and books:\n\n***Movies:***\n\n1. Trollhunter (2010)\n2. Trolls (2016)\n3. The Lord of the Rings Series\n4. Frozen (2013)\n5. Erik the Viking (1989)\n\n***Books:***\n\n1. The Hobbit by J.R.R. Tolkien\n2. The Troll Queen by John Vornholt\n3. Trolls by Brian Froud and Wendy Froud\n4. The Princess and the Goblin by George MacDonald\n5. Troll: A Love Story by Johanna Sinisalo\n6. Scandinavian Folk Belief and Legend by Reimund Kvideland and Henning K. Sehmsdorf\n\nMore cultural adventures coming soon!\n"}]},"__N_SSG":true}